$(document).ready(function () {
    $('select').formSelect();
    $('.datepicker').datepicker({
        format: 'dd.mm.yyyy',
        container: 'body',
        i18n: {
            months: ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"],
            monthsShort: ["Янв", "Фев", "Мар", "Апр", "Май", "Июн", "Июл", "Авг", "Сен", "Окт", "Ноя", "Дек"],
            weekdays: ["Воскресенье", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота"],
            weekdaysShort: ["Вс", "Пн", "Вт", "Ср", "Чт", "Пт", "Сб"],
            weekdaysAbbrev: ["В", "П", "В", "С", "Ч", "П", "С"],
            cancel: 'Отмена',
            clear: 'Очистить',
            done: 'Ок'
        }
    });
    $('.sidenav').sidenav();
});
